In [1]:
import pandas as pd

In [4]:
dados = {
    'Nome': ["Alice", "Maquerle", "Marcelo"],
    'Idade': [5,32,34],
    'Cidade': ["Vitória", "Cachoeiro", "Serra"]
}

dados

{'Nome': ['Alice', 'Maquerle', 'Marcelo'],
 'Idade': [5, 32, 34],
 'Cidade': ['Vitória', 'Cachoeiro', 'Serra']}

In [5]:
df = pd.DataFrame(dados)
df

       Nome  Idade     Cidade
0     Alice      5    Vitória
1  Maquerle     32  Cachoeiro
2   Marcelo     34      Serra

In [6]:
df.head()

       Nome  Idade     Cidade
0     Alice      5    Vitória
1  Maquerle     32  Cachoeiro
2   Marcelo     34      Serra

In [16]:
dados_notas = {
    "Nome": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Matematica": [85,86,99,60,57],
    "Fisica": [78, 66, 95, 59, 67],
    "Quimica": [87, 76, 65, 70, 87]
}

In [17]:
df_notas = pd.DataFrame(dados_notas)

In [18]:
df_notas

      Nome  Matematica  Fisica  Quimica
0    Alice          85      78       87
1      Bob          86      66       76
2  Charlie          99      95       65
3    David          60      59       70
4      Eva          57      67       87

In [19]:
# Calculando a média das notas por aluno
df_notas['Média'] = df_notas[['Matematica', 'Fisica', 'Quimica']].mean(axis=1)

In [20]:
df_notas

      Nome  Matematica  Fisica  Quimica      Média
0    Alice          85      78       87  83.333333
1      Bob          86      66       76  76.000000
2  Charlie          99      95       65  86.333333
3    David          60      59       70  63.000000
4      Eva          57      67       87  70.333333

In [23]:
#Identificar alunos aprovados com nota boa (média >= 82.5)
alunos_aprovados = df_notas[df_notas['Média'] >= 82.5]
alunos_aprovados

      Nome  Matematica  Fisica  Quimica      Média
0    Alice          85      78       87  83.333333
2  Charlie          99      95       65  86.333333

In [25]:
# Exibir a média e os alunos aprovados
df_notas[['Nome', 'Média']]

      Nome      Média
0    Alice  83.333333
1      Bob  76.000000
2  Charlie  86.333333
3    David  63.000000
4      Eva  70.333333

In [26]:
alunos_aprovados[['Nome', 'Média']]

      Nome      Média
0    Alice  83.333333
2  Charlie  86.333333